[
    {
        "logo": "lyftLogo.svg",
        "company": "Lyft",
        "position": "Software Engineering Intern",
        "description": "This Summer, I am currently working for Lyft as a Software Engineering Intern on the Machine Learning platform. As an intern, my project entailed creating a set of validation tools for modelers to verify that their models are compatible with LyftLearn Serving. These tools step through the loading, training and inference processes on a modeler's local machine and is compatible with dvelopment in a Jupyter Notebook as well as a traditional Git repository. Over the course of the internship, I consulted my teammates to devise features that would be useful for the modelers to use in their work. This included integrations with AWS S3 buckets, automated reading of model configuration files, and example pytest cases for use in unit testing."
    },
    {
        "logo": "awsLogo.png",
        "company": "Clemson Capstone Program - AWS",
        "position": "Software Engineer",
        "description": "In Spring 2022, I worked on the Clemson University School of Computing Capstone team for Amazon Web Services. The goal of this project was to iterate on the sign in system for the Clemson Makerspace and meet their needs for intuitive data analysis. In addition, we took steps to improve the long-term maintainability of the system. My tasks towards these goals included the development of PyTest unit tests that were automated by GitHub Actions, implementing a localization feature that could track user sign-ins by individual location, altering the DynamoDB table structure to separate out user information and sign-in information, and creating a data migration script that would transfer all existing data from the old table to the new tables."
    },
    {
        "logo": "metaLogo.png",
        "company": "Meta",
        "position": "Software Engineering Intern",
        "description": "In Fall 2021, I worked for Meta as a Software Engineering Intern on the Android Video Playback team. As an intern, my projects involded tuning values for initial buffering, refactoring a stall monitor in Kotlin used to trigger dynamic rebuffering, and I developed a UI to indicate to users when a live broadcast was interrupted due to poor network connections. I also implemented improved logging for our video player so we could better triage issues with live streams. Each of these developments reduced the amount of poor viewing experiences by reducing the amount of time spent buffering the video and/or the amount of stalls encountered during playback. "
    },
    {
        "logo": "sfLogo.png",
        "company": "State Farm",
        "position": "Technology Intern",
        "description": "In Summer 2021, I worked for State Farm as a Technology Intern on their Customer Data team. As an intern, my main project involved developing dashboards with DynaTrace that could monitor our Spring backend integrator. In addition, I also developed new REST and SOAP endpoints for the integrator. This development also allowed me to gain experience with Karate testing for APIs, as well as proper documentation practices. In addition, these projects helped us improve our triaging processes for issues with our consumers."
    },
    {
        "logo": "cevacLogo.png",
        "company": "Clemson Energy Visualization and Analytics Center",
        "position": "CEVAC Intern",
        "description": "In Spring 2021 and Spring 2022, I worked for the Clemson Energy Visualization and Analytics Center as a UPIC intern. As the UPIC intern, I mainly worked on the building occupancy modeling project, where I analyzed data to create ML models that would predict future building occupancies. This internship was mainly research-based, and allowed me to gain experience with libraries such as Facebook Prophet, XGBoost, Scikit-Learn and Pandas. I also was able to practice my SQL skills for data collection."
    }
]
